In [1]:
import pandas as pd

a = pd.read_csv('house_level_flemms.csv')

In [2]:
a.head()

,CASE_ID,Bgy_Code,Construction Materials of the Outer Walls,Fuel for Lighting,Source of Water Supply for Drinking,Tenure Status of the Housing Unit/Lot,Sex,Single Year-Age Classification,Copy of Birth Certificate,Marital Status,Literacy,Highest Grade Completed,If graduate of Technical/Vocational Course,Overseas Worker
0,15707000010010000001000001,157001001,2,6.0,9.0,1.0,1.0,37.0,1.0,2.0,1.0,220.0,2.0,2.0
1,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,31.0,1.0,2.0,1.0,170.0,2.0,2.0
2,15707000010010000001000001,157001001,2,6.0,9.0,1.0,1.0,12.0,1.0,1.0,1.0,150.0,NaN,NaN
3,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,10.0,1.0,1.0,1.0,140.0,NaN,NaN
4,15707000010010000001000001,157001001,2,6.0,9.0,1.0,2.0,7.0,1.0,1.0,1.0,110.0,NaN,NaN

In [3]:
b = a.iloc[:,:3].drop_duplicates().reset_index(drop=True)
b = b.dropna()

In [4]:
b.head()

,CASE_ID,Bgy_Code,Construction Materials of the Outer Walls
0,15707000010010000001000001,157001001,2
1,15707000010010000002000002,157001001,2
2,15707000010010000003000003,157001001,2
3,15707000010010000004000004,157001001,2
4,15707000010010000005000005,157001001,2

In [5]:
b['Construction Materials of the Outer Walls'].value_counts()

2     354496
5     160944
1     102959
3      86599
4       8868
99      3659
8       3614
6       1872
9        866
10       330
11       228
7        147
Name: Construction Materials of the Outer Walls, dtype: int64

In [6]:
b = b[b['Construction Materials of the Outer Walls'] != 99]

In [7]:
b['Construction Materials of the Outer Walls'].value_counts()

2     354496
5     160944
1     102959
3      86599
4       8868
8       3614
6       1872
9        866
10       330
11       228
7        147
Name: Construction Materials of the Outer Walls, dtype: int64

In [8]:
import numpy as np


condition1 = [(b['Construction Materials of the Outer Walls'] == 1),
              (b['Construction Materials of the Outer Walls'] == 3),
              (b['Construction Materials of the Outer Walls'] == 4),
              (b['Construction Materials of the Outer Walls'] == 6),
              (b['Construction Materials of the Outer Walls'] == 7)
             ]
b['Household with Concrete Walls Proportion'] = np.select(condition1, [1,1,1,1,1], 0)

In [9]:
b.head()

,CASE_ID,Bgy_Code,Construction Materials of the Outer Walls,Household with Concrete Walls Proportion
0,15707000010010000001000001,157001001,2,0
1,15707000010010000002000002,157001001,2,0
2,15707000010010000003000003,157001001,2,0
3,15707000010010000004000004,157001001,2,0
4,15707000010010000005000005,157001001,2,0

In [10]:
c = b.iloc[:, [1] + [-1]]

In [11]:
c.head()

    Bgy_Code  Household with Concrete Walls Proportion
0  157001001                                         0
1  157001001                                         0
2  157001001                                         0
3  157001001                                         0
4  157001001                                         0

In [12]:
len(c)

720923

In [13]:
d = c.groupby(c['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Household with Concrete Walls Proportion':'mean'}).reset_index(drop=True)

In [14]:
d.head()

    Bgy_Code  Household with Concrete Walls Proportion
0  124702010                                  0.297401
1  124702015                                  0.239592
2  124702016                                  0.053498
3  124702024                                  0.246277
4  124702027                                  0.218845

In [15]:
len(d)

2589

In [16]:
e = a.iloc[:, [0, 1, 3]].drop_duplicates().reset_index(drop=True)
e = e.dropna()

In [17]:
e.head()

                      CASE_ID   Bgy_Code  Fuel for Lighting
0  15707000010010000001000001  157001001                6.0
1  15707000010010000002000002  157001001                6.0
2  15707000010010000003000003  157001001                6.0
3  15707000010010000004000004  157001001                6.0
4  15707000010010000005000005  157001001                6.0

In [18]:
e['Fuel for Lighting'].value_counts()

1.0    399069
2.0    130068
6.0    109304
5.0     73455
3.0      4286
4.0      2085
0.0      1637
7.0      1351
9.0       393
Name: Fuel for Lighting, dtype: int64

In [19]:
e = e[e['Fuel for Lighting'] != 9]

In [20]:
e['Fuel for Lighting'].value_counts()

1.0    399069
2.0    130068
6.0    109304
5.0     73455
3.0      4286
4.0      2085
0.0      1637
7.0      1351
Name: Fuel for Lighting, dtype: int64

In [21]:
condition2 = [(e['Fuel for Lighting'] == 1.0)]
e['Access to Electricity Proportion'] = np.select(condition2, [1], 0)

In [22]:
e.head()

,CASE_ID,Bgy_Code,Fuel for Lighting,Access to Electricity Proportion
0,15707000010010000001000001,157001001,6.0,0
1,15707000010010000002000002,157001001,6.0,0
2,15707000010010000003000003,157001001,6.0,0
3,15707000010010000004000004,157001001,6.0,0
4,15707000010010000005000005,157001001,6.0,0

In [23]:
f = e.iloc[:, [1] + [-1]]

In [24]:
f.head()

    Bgy_Code  Access to Electricity Proportion
0  157001001                                 0
1  157001001                                 0
2  157001001                                 0
3  157001001                                 0
4  157001001                                 0

In [25]:
g = f.groupby(f['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Access to Electricity Proportion':'mean'}).reset_index(drop=True)

In [26]:
g.head()

    Bgy_Code  Access to Electricity Proportion
0  124702010                          0.425552
1  124702015                          0.479183
2  124702016                          0.343621
3  124702024                          0.878580
4  124702027                          0.419453

In [27]:
len(g)

2589

In [28]:
h = a.iloc[:, [0, 1, 4]].drop_duplicates().reset_index(drop=True)
h = h.dropna()

In [29]:
h.head()

                      CASE_ID   Bgy_Code  Source of Water Supply for Drinking
0  15707000010010000001000001  157001001                                  9.0
1  15707000010010000002000002  157001001                                  9.0
2  15707000010010000003000003  157001001                                  9.0
3  15707000010010000004000004  157001001                                  9.0
4  15707000010010000005000005  157001001                                  9.0

In [30]:
h['Source of Water Supply for Drinking'].value_counts()

6.0     139090
4.0     127395
1.0     101485
2.0     101021
9.0      75335
3.0      48958
7.0      39602
10.0     30646
5.0      19841
8.0      19208
11.0     16036
12.0      3031
Name: Source of Water Supply for Drinking, dtype: int64

In [31]:
h = h[h['Source of Water Supply for Drinking'] != 99]

In [32]:
h['Source of Water Supply for Drinking'].value_counts()

6.0     139090
4.0     127395
1.0     101485
2.0     101021
9.0      75335
3.0      48958
7.0      39602
10.0     30646
5.0      19841
8.0      19208
11.0     16036
12.0      3031
Name: Source of Water Supply for Drinking, dtype: int64

In [33]:
condition3 = [(h['Source of Water Supply for Drinking'] == 1),
              (h['Source of Water Supply for Drinking'] == 2),
              (h['Source of Water Supply for Drinking'] == 7),
              (h['Source of Water Supply for Drinking'] == 11)
             ]
h['Access to Treated Water Proportion'] = np.select(condition3, [1,1,1,1], 0)

In [34]:
h.head()

,CASE_ID,Bgy_Code,Source of Water Supply for Drinking,Access to Treated Water Proportion
0,15707000010010000001000001,157001001,9.0,0
1,15707000010010000002000002,157001001,9.0,0
2,15707000010010000003000003,157001001,9.0,0
3,15707000010010000004000004,157001001,9.0,0
4,15707000010010000005000005,157001001,9.0,0

In [35]:
i = h.iloc[:, [1] + [-1]]

In [36]:
i.head()

    Bgy_Code  Access to Treated Water Proportion
0  157001001                                   0
1  157001001                                   0
2  157001001                                   0
3  157001001                                   0
4  157001001                                   0

In [37]:
j = i.groupby(i['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Access to Treated Water Proportion':'mean'}).reset_index(drop=True)

In [38]:
j.head()

    Bgy_Code  Access to Treated Water Proportion
0  124702010                            0.003842
1  124702015                            0.041634
2  124702016                            0.012346
3  124702024                            0.002291
4  124702027                            0.009119

In [39]:
len(j)

2589

In [40]:
k = a.iloc[:, [0, 1, 5]].drop_duplicates().reset_index(drop=True)
k = k.dropna()

In [41]:
k.head()

,CASE_ID,Bgy_Code,Tenure Status of the Housing Unit/Lot
0,15707000010010000001000001,157001001,1.0
1,15707000010010000002000002,157001001,1.0
2,15707000010010000003000003,157001001,1.0
3,15707000010010000004000004,157001001,1.0
4,15707000010010000005000005,157001001,1.0

In [42]:
k['Tenure Status of the Housing Unit/Lot'].value_counts()

1.0    440519
4.0    195693
6.0     29664
3.0     23294
5.0     17763
2.0     11947
7.0      2491
9.0       265
0.0        12
Name: Tenure Status of the Housing Unit/Lot, dtype: int64

In [43]:
k = k[k['Tenure Status of the Housing Unit/Lot'] != 9]

In [44]:
k['Tenure Status of the Housing Unit/Lot'].value_counts()

1.0    440519
4.0    195693
6.0     29664
3.0     23294
5.0     17763
2.0     11947
7.0      2491
0.0        12
Name: Tenure Status of the Housing Unit/Lot, dtype: int64

In [45]:
condition4 = [(k['Tenure Status of the Housing Unit/Lot'] == 1)]
k['Owned House and Lot Proportion'] = np.select(condition4, [1], 0)

In [46]:
k.head()

,CASE_ID,Bgy_Code,Tenure Status of the Housing Unit/Lot,Owned House and Lot Proportion
0,15707000010010000001000001,157001001,1.0,1
1,15707000010010000002000002,157001001,1.0,1
2,15707000010010000003000003,157001001,1.0,1
3,15707000010010000004000004,157001001,1.0,1
4,15707000010010000005000005,157001001,1.0,1

In [47]:
l = k.iloc[:, [1] + [-1]]

In [48]:
l.head()

    Bgy_Code  Owned House and Lot Proportion
0  157001001                               1
1  157001001                               1
2  157001001                               1
3  157001001                               1
4  157001001                               1

In [49]:
m = l.groupby(l['Bgy_Code']).aggregate({'Bgy_Code': 'first', 'Owned House and Lot Proportion':'mean'}).reset_index(drop=True)

In [50]:
m.head()

    Bgy_Code  Owned House and Lot Proportion
0  124702010                        0.958694
1  124702015                        0.554595
2  124702016                        0.985597
3  124702024                        0.557847
4  124702027                        0.641337

In [51]:
len(m)

2589

In [52]:
household_data1 = pd.merge(d, g)

In [53]:
household_data2 = pd.merge(household_data1, j)

In [54]:
household_data3 = pd.merge(household_data2, m)

In [55]:
household_data3.head()

,Bgy_Code,Household with Concrete Walls Proportion,Access to Electricity Proportion,Access to Treated Water Proportion,Owned House and Lot Proportion
0,124702010,0.297401,0.425552,0.003842,0.958694
1,124702015,0.239592,0.479183,0.041634,0.554595
2,124702016,0.053498,0.343621,0.012346,0.985597
3,124702024,0.246277,0.878580,0.002291,0.557847
4,124702027,0.218845,0.419453,0.009119,0.641337

In [57]:
len(household_data3['Bgy_Code'].unique())

2589

In [58]:
household_data3.to_csv('household_data_final.csv', index = False)